jeffmhopkins/JBrain2/firmware/sdkconfig.defaults
# Baseline config for the room endpoint. Anything not needed to get on Wi-Fi and take an OTA
# is deliberately absent — see README "What the first firmware does not do".
CONFIG_IDF_TARGET="esp32s3"

# 16 MB NOR flash, per the Waveshare spec for this board.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# The whole point of this firmware. Without it a bad image is permanent and the fix is a cable.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# BOTH trust paths are compiled in, because which one a panel needs is decided at flash
# time, not here. A box reached at its LAN name sits behind Caddy's internal CA and hands
# its own root over in NVS; a box reached at a public hostname has an ordinary certificate
# and needs the bundle. Shipping only the first made the second fail TLS on every request
# with no symptom but silence — the panel joins Wi-Fi and can never reach the box.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# The panel's console goes out over the SAME native USB it is flashed through, which is
# what lets `deploy/endpoint`'s monitor read it with no second cable and no UART header.
# Already ESP-IDF's default for this target; pinned because it is load-bearing for the
# only view anyone has of a flashed unit, and silence would be indistinguishable from a
# panel that had nothing to say.
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# PSRAM: 8 MB of it, Octal, on the ESP32-S3R8 this board carries. Deliberately absent from
# 0.2.x until a unit had proved it could take an OTA, because a PSRAM misconfiguration is the
# class of fault that ends in a boot loop and a boot loop ends with a screwdriver
# (firmware/README.md). It arrives now, over the air, onto a panel that has taken two.
#
# It is the gate for everything visual rather than a nice-to-have: one RGB565 framebuffer at
# 368x448 is 322 KB and this chip has ~332 KB of internal RAM free at boot, with Wi-Fi and
# TLS still to feed. The display cannot exist without this line.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# DEGRADE, do not abort. If the mode is wrong — Quad silicon behind an Octal config, say —
# the default is to panic in early boot, which is a boot loop on a device with no cable. This
# turns that into "came up without PSRAM", which the rollback gate does NOT catch (the panel
# still reaches the box and marks itself good) — so the boot log reports the size explicitly
# and that reading, not "it booted", is what says this worked.
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Keep the image honest about which build is running: the OTA check compares this against the
# manifest, so a hand-edited version string would loop or stall the updates.
CONFIG_APP_PROJECT_VER_FROM_CONFIG=n

# The committed images in `dist/` ARE the release (see README), so CI has to be able to
# prove they match this source — which it can only do if the same source builds the same
# bytes. Without this, ESP-IDF stamps __DATE__/__TIME__ and absolute build paths into the
# app descriptor and every build differs, making the check unwritable.
CONFIG_APP_REPRODUCIBLE_BUILD=y

# THE SPEECH MODELS. MultiNet7 is the only English command model that fits the 3.5 MB `model`
# partition — MultiNet6 is 3.7 MB on its own. The packed set is 2.91 MB, leaving 17% spare,
# and esp-sr's own packer recommends 2982K against the 3584K reserved.
#
# THE COMMAND LIST IS NOT IN HERE. MultiNet phrases are supplied at runtime as phoneme strings
# (`esp_mn_commands_update()`), so changing what he answers to is an ordinary OTA. This file
# only decides the wake word and the model generation, which is why one USB flash is enough.
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_SR_MN_EN_MULTINET7_QUANT=y

# THE RECOGNISER'S SCRATCH SPACE LIVES IN PSRAM, AND SO DO THE RADIO'S BUFFERS.
# This board has 8 MB of PSRAM and 341 KB of DIRAM, and linking esp-sr took static DIRAM to
# 90.4% — leaving `esp_wifi_init` 18 KB of internal heap where it needs far more for DMA
# descriptors that can live nowhere else. Two settings claw it back:
#   * BSS_SEG_EXTERNAL_MEMORY lets `main/linker.lf` exile libnsnet3's 117 KB scratch buffer,
#     which belongs to a noise-suppression model this firmware never selects or runs.
#   * TRY_ALLOCATE_WIFI_LWIP lets the Wi-Fi and TCP/IP stacks take their non-DMA buffers from
#     PSRAM, so what is left of internal RAM goes to the descriptors that genuinely need it.
# See ROOM_ENDPOINT_PLAN.md §10.4ax.
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
